Revit 2024 API
StairsLandingType.IsMonolithic Property
 True if the stairs landing is monolithic, false otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsMonolithic { get; }
Visual Basic
Public ReadOnly Property IsMonolithic As Boolean
	Get
Visual C++
public:
property bool IsMonolithic {
	bool get ();
}
See Also
StairsLandingType Class
Autodesk.Revit.DB.Architecture Namespace